Repository: Kungsbacka/Grouper
Catalog: GrouperLib/GrouperLib.Language/Resources/Resources.*.resx
Languages: sv

# DefaultValidationError
source: Unable to validate document contents
sv: Kunde inte validera innehållet i dokumentet

# ErrorBelowChangeLimit
source: Change ratio is below limit. No changes are made to the group members
sv: Förhållandet mellan tillägg och borttag är lägre än gränsvärdet. Inga ändringar av medlemmarna i gruppen kommer att göras.

# ErrorGrouperDocumentNotValid
source: JSON document does not represent a valid Grouper document
sv: JSON-dokumentet representerar inte ett giltigt Grouper-dokument

# GenericErrorMessage
source: An error occured
sv: Ett fel inträffade

# ValidationCouldNotDeserializeJson
source: Unable to deserialize JSON to intermediate Grouper document. Check if JSON represents a Grouper document
sv: Kunde inte översätta JSON till ett Grouper-dokument. Kontrollera att JSON representerar ett Grouper dokument

# ValidationErrorDocumentIdNotValid
source: Document ID is missing or not a valid GUID (ID: {0})
sv: Dokument-ID saknas eller har fel format (ID: {0})

# ValidationErrorDuplicateMemberObject
source: The same member object can only appear once for each group (Member source: {0}, Member action: {1}, Member count: {2})
sv: Samma medlemsobjekt kan bara förekomma en gång per grupp (Member source: {0}, Member action: {1}, Member count: {2})

# ValidationErrorDuplicateRule
source: The same rule name and value cannot appear more than once (Rule name: {0}, Rule value: {1})
sv: Samma regel får inte förekomma mer än en gång (Rule name: {0}, Rule value: {1})

# ValidationErrorDuplicateRuleName
source: Rule name can only appear once for every rulse set (Rule name: {0})
sv: Ett regelnamn kan bara förekomma en gång i varje uppsättning regler (Rule name: {0})

# ValidationErrorGroupIdNotValid
source: Group ID is missing or not a valid GUID (ID: {0})
sv: Grupp-ID saknas eller har fel format (ID: {0})

# ValidationErrorGroupNameIsNullOrEmpty
source: Group name is missing or empty
sv: Gruppnamn saknas eller är tomt

# ValidationErrorIllegalInterval
source: Processing interval hint must be greater or equal to zero
sv: Önskat processintervall kan inte vara mindre än noll

# ValidationErrorInvalidCombinationOfGroupStoreAndMemberSource
source: Invalid combination of group store and member source (Group store: {0}, Member source: {1})
sv: Kombinationen av gruppkatalog och medlemskälla är inte giltig (Group store: {0}, Member source: {1})

# ValidationErrorInvalidCombinationOfRules
source: This combination of rules is not valid for selected member source (Member source: {0})
sv: Kombinationen av regler är inte tillåten för vald medlemskälla (Member source: {0})

# ValidationErrorInvalidGroupStore
source: Group store is missing or invalid (Group store: {0})
sv: Gruppkatalog saknas eller är tomt (Group store: {0})

# ValidationErrorInvalidMemberAction
source: Member action is missing or invalid. Valid actions are "Include" or "Exclude" (Member action: {0})
sv: Medlemsåtgärd saknas eller är ogiltig. Godkända åtgärder är "Include" eller "Exclude" (Member action: {0})

# ValidationErrorInvalidMemberSource
source: Member source is missing or invalid (Member source: {0})
sv: Medlemskälla saknas eller är ogiltig (Member source: {0})

# ValidationErrorInvalidOwnerAction
source: Owner action is missing or invalid. Valid actions are "AddAll", "KeepExisting" or "MatchSource" (Owner action: {0})"
sv: Ägaråtgård saknas eller är felaktig. Godkända åtgärder är "AddAll", "KeepExisting" eller "MatchSource" (Owner action: {0})

# ValidationErrorInvalidRuleName
source: Rule name is missing or can not be used in combination with the selected member source (Rule name: {0}, Member source: {1})
sv: Regelns namn är inte giltigt eller kan inte användas i kombination med vald medlemskälla (Rule name: {0}, Member source: {1})

# ValidationErrorInvalidUpn
source: Rule value is not a valid UserPrincipalName (Rule value: {0})
sv: Regelns värde är inte ett giltigt UserPrincipalName (Rule value: {0})

# ValidationErrorMemberObjectHasNoRules
source: No rules found for member object
sv: Inga regler finns för medlemsobjektet

# ValidationErrorNoMemberObjects
source: No member objects found
sv: Inga medlemsobjeckt finns

# ValidationErrorRuleValueDoesNotValidate
source: Rule value is invalid (Rule name: {0}, Rule value: {1})
sv: Regels värde är ogiltigt (Rule name: {0}, Rule value: {1})

# ValidationErrorRuleValueIsNullOrEmpty
source: Rule value is missing (Rule: {0})
sv: Regelns värde saknas eller är tomt (Rule: {0})

# ValidationErrorSourceGroupSameAsTarget
source: The same group cannot be used both as member source and target group
sv: Samma grupp som uppdateras kan inte användas som medlemskälla

# ValidationErrorStoreNotRecognized
source: The validator does not recognize the group store {0}
sv: Validatorn känner inte igen gruppkatalogen {0}

# ValidationJsonParsingError
source: An error occured while parsing JSON document on line {0} column {1}. The error message is: {2}
sv: Ett fel uppstod när JSON-dokumentet skulle tolkas. Felet finns på rad {0} position {1}. Felmeddelandet är: {2}
